---
kind: method
id: M:Autodesk.Revit.UI.Events.SelectionChangedEventArgs.GetDocument
source: html/7d51c9f8-1bea-32ec-0e54-5921242e57c3.htm
---
# Autodesk.Revit.UI.Events.SelectionChangedEventArgs.GetDocument Method

Returns the document associated with this event.

## Syntax (C#)
```csharp
public Document GetDocument()
```